---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.OrthogonalAndOverallDimesionsEnabled
source: html/c3e01192-7ad8-4d69-84a1-680d6a66bb74.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.OrthogonalAndOverallDimesionsEnabled Property

Identifies if orthogonal and overall dimensions are displayed.

## Syntax (C#)
```csharp
public bool OrthogonalAndOverallDimesionsEnabled { get; set; }
```

## Remarks
Orthogonal segment length dimensions are dimensions defining the slope of a bar segment.
 Overall dimensions are dimensions that spans over multiple segments.